aaron-bond.better-comments
alefragnani.project-manager
alexcvzz.vscode-sqlite
aykutsarac.jsoncrack-vscode
batisteo.vscode-django
bceskavich.theme-dracula-at-night
bierner.markdown-mermaid
burkeholland.simple-react-snippets
charliermarsh.ruff
cipchk.cssrem
codezombiech.gitignore
continue.continue
cstrap.python-snippets
deerawan.vscode-dash
demystifying-javascript.python-extensions-pack
dnicolson.binary-plist
donjayamanne.git-extension-pack
donjayamanne.githistory
dracula-theme.theme-dracula
eamodio.gitlens
evondev.indent-rainbow-palettes
foxundermoon.shell-format
github.vscode-pull-request-github
hbenl.vscode-test-explorer
kaih2o.python-resource-monitor
kevinrose.vsc-python-indent
lakshits11.monokai-pirokai
littlefoxteam.vscode-python-test-adapter
marp-team.marp-vscode
mechatroner.rainbow-csv
meowteam.vscode-math-to-image
mintlify.document
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.remote-explorer
ms-vscode.test-adapter-converter
njpwerner.autodocstring
njqdev.vscode-python-typehint
oderwat.indent-rainbow
pkief.material-icon-theme
randomfractalsinc.vscode-data-preview
redhat.vscode-yaml
ritwickdey.liveserver
shd101wyy.markdown-preview-enhanced
shinotatwu-ds.file-tree-generator
sidthesloth.html5-boilerplate
sourcery.sourcery
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
thebarkman.vscode-djaneiro
tianyishi.rmarkdown
tomoki1207.pdf
twxs.cmake
vscodevim.vim
xirider.livecode
yzane.markdown-pdf
yzhang.markdown-all-in-one
zainchen.json
zhangciwu.swig-tpl
zhouronghui.propertylist
ziyasal.vscode-open-in-github
